IDEA Open Model
LineSupport.OnWallEdge Property
Compatible with IDEA StatiCa v 10.1
 true to add line support on wall edge
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public bool OnWallEdge { get; set; }
Public Property OnWallEdge As Boolean
	Get
	Set
public:
property bool OnWallEdge {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace